CANCEL_KEY = "❌ Отмена"
COMPLETE_KEY = "✅ Подтвердить"
BACK_KEY = "🔙 Назад"

SELECT_WILL_TYPE_TICKET = (
    "Выберите тип заявки:\n\n"
    "🐛 <b>Инцидент</b> — если что-то сломалось\n"
    "📋 <b>Запрос</b> — если вам что-то нужно"
)
INPUT_WILL_HEAD = (
    "📝 Введите краткий заголовок заявки "
    "(например: 'Проблема с принтером'):"
    )

INPUT_WILL_DISCRIPTION = (
    "✏️ Теперь подробно опишите проблему:\n\n"
    "• Что произошло?\n"
    "• Когда возникла проблема?\n"
    "• Укажите имя ПК, с которым связана проблема\n"
    "• Какие ошибки видите?\n\n"
    "  Напишите данные, которые могли бы помочь быстрее решить проблему:\n\n"
    "• Укажите имя ПК, с которым связана проблема\n"
    "• Если проблема связана с оборудование, напишите его модель"
)
INPUT_WILL_REPEAT_DESCRIPTION = "Редактируем описание. Введите новый текст:"

CHANGE_WILL_TYPE_TICKET = "Пожалуйста, выберите тип заявки кнопками ниже:"

RETURN_TO_MAIN_MENU = "Вы вернулись в главное меню"
CHANGE_TYPE_TICKET = "Вы вернулись к выбору типа заявки"

INVALID_HEADER = (
    "❌ Заголовок должен содержать минимум 5 символов. "
    "Попробуйте еще раз:"
)
INVALID_DISCRIPTION = (
    "❌ Описание должно содержать минимум 10 символов. "
    "Пожалуйста, опишите подробнее:"
)
ERROR_CREATE_TICKET = (
    "❌ Произошла ошибка при создании заявки. "
    "Пожалуйста, попробуйте позже."
)
