
# Базовык кнопки
CANCEL_KEY = "❌ Отмена"
COMPLETE_KEY = "✅ Подтвердить"
BACK_KEY = "🔙 Назад"


START_MESSAGE = (
    "👋 Привет! Я помогу вам создать заявку "
    "в техническую поддержку <b>ООО \"Проф ИТ\"</b>"
)

AUTH_REQUIRED_MESSAGE = (
    "Для продолжения работы с ботом <b>необходима авторизация</b>\n"
    "Введите свой логин, используемый в вашей организации "
    "(например: <code>ivanov_ii</code>):"
)


SELECT_TYPE_TICKET = (
    "Выберите тип заявки:\n\n"
    # "🛠 <b>Инцидент</b> — если что-то сломалось\n"
    # "📋 <b>Запрос</b> — если вам что-то нужно"
    "🛠 <b>Инцидент</b> — если что-то сломалось (ошибки, сбои)\n\n"
    "📋 <b>Запрос</b> — если вам что-то нужно (доступы, обучение, сопровождение)"
)


CHANGE_WILL_TYPE_TICKET = "Пожалуйста, выберите тип заявки кнопками ниже:"


INVALID_HEADER = (
    "❌ Заголовок должен содержать минимум 5 символов. "
    "Попробуйте еще раз:"
)
INVALID_DISCRIPTION = (
    "❌ Описание должно содержать минимум 10 символов. "
    "Пожалуйста, опишите подробнее:"
)
ERROR_CREATE_TICKET = (
    "❌ Произошла ошибка при создании заявки. "
    "Пожалуйста, попробуйте позже."
)
