
# Длина проверочного кода
LENGTH_CODE = 4

MAIL_NOT_FOUND=(
    "Mail не найден для данного пользователя\n"
    "Обратитесь к вашему системному администратору"
    )

LOGIN_NOT_FOUND=(
    "❌ Пользователь с таким логином не найден.\n"
    "Попробуйте ввести логин еще раз"
    )

AUTHORIZATION_ERROR=(
    "Сервис авторизации временно недоступен.\n"
    "Попробуйте позже или обратитесь в поддержку."
    )

CONFIRMATION_CODE_SENT = (
    "Код подтверждения отправлен на <b>{mail}</b>\n"
    "⏳ Код действителен в течение 5 минут\n"
    "Введите его для завершения авторизации:"
)
