
LENGTH_CODE = 4

REGISTER_NEEDED=(
    "Для продолжения взаимодействия с ботом необходима авторизация\n"
    "Введите свой логин, используемый в вашей организации (н-р: ivanov_ii):"
    )

MAIL_NOT_FOUND=(
    "Mail не найден для данного пользователя\n"
    "Обратитесь к вашему системному администратору"
    )

USER_NOT_FOUND= ( "Пользователь с данным логином не найден.\n")

LOGIN_NOT_FOUND=(
    "❌ Пользователь с таким логином не найден.\n"
    "Попробуйте ввести логин еще раз:"
    )

LOGIN_FOUND=(
    "На вашу корпоративную почту: {} направлено письмо с кодом подтверждения.\n"
    )

AUTHORIZATION_ERROR=(
    "Сервис авторизации временно недоступен.\n"
    "Попробуйте позже или обратитесь в поддержку."
    )
